---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientTopDirn1
source: html/c21afc86-d70e-51f9-5777-7c74de120689.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientTopDirn1 Property

"Top Major Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookOrientTopDirn1 { get; }
```